{"weightsManifest": [{"paths": ["group1-shard1of21.bin", "group1-shard2of21.bin", "group1-shard3of21.bin", "group1-shard4of21.bin", "group1-shard5of21.bin", "group1-shard6of21.bin", "group1-shard7of21.bin", "group1-shard8of21.bin", "group1-shard9of21.bin", "group1-shard10of21.bin", "group1-shard11of21.bin", "group1-shard12of21.bin", "group1-shard13of21.bin", "group1-shard14of21.bin", "group1-shard15of21.bin", "group1-shard16of21.bin", "group1-shard17of21.bin", "group1-shard18of21.bin", "group1-shard19of21.bin", "group1-shard20of21.bin", "group1-shard21of21.bin"], "weights": [{"dtype": "float32", "shape": [512], "name": "batch_normalization_1/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_1/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_1/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_1/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_2/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_2/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_2/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_2/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_3/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_3/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_3/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_3/moving_variance"}, {"dtype": "float32", "shape": [256, 1024], "name": "bidirectional_1/forward_lstm_1/kernel"}, {"dtype": "float32", "shape": [256, 1024], "name": "bidirectional_1/forward_lstm_1/recurrent_kernel"}, {"dtype": "float32", "shape": [1024], "name": "bidirectional_1/forward_lstm_1/bias"}, {"dtype": "float32", "shape": [256, 1024], "name": "bidirectional_1/backward_lstm_1/kernel"}, {"dtype": "float32", "shape": [256, 1024], "name": "bidirectional_1/backward_lstm_1/recurrent_kernel"}, {"dtype": "float32", "shape": [1024], "name": "bidirectional_1/backward_lstm_1/bias"}, {"dtype": "float32", "shape": [22528, 512], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [512], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [512, 512], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [512], "name": "dense_2/bias"}, {"dtype": "float32", "shape": [512, 11383], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [11383], "name": "dense_3/bias"}, {"dtype": "float32", "shape": [11384, 256], "name": "embedding_1/embeddings"}]}], "modelTopology": {"keras_version": "2.2.4", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 44], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_1", "dtype": "float32", "output_dim": 256, "trainable": true, "embeddings_regularizer": null, "input_dim": 11384, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 44], "activity_regularizer": null, "input_length": 44}, "name": "embedding_1"}, {"class_name": "Bidirectional", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "implementation": 1, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "unit_forget_bias": true, "activation": "tanh", "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "return_state": false, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, "trainable": true, "name": "bidirectional_1"}, "name": "bidirectional_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_1"}, "name": "batch_normalization_1"}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "seed": null, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "Flatten", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "name": "flatten_1"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null}, "name": "dense_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_2"}, "name": "batch_normalization_2"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "name": "activation_1"}, {"class_name": "Dropout", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "seed": null, "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null}, "name": "dense_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_3"}, "name": "batch_normalization_3"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "name": "activation_2"}, {"class_name": "Dropout", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "seed": null, "name": "dropout_3"}, "name": "dropout_3"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 11383, "use_bias": true, "activity_regularizer": null}, "name": "dense_3"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]], "name": "model_1"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "format": "layers-model"}